EDT/ZUP/zup_edt/src/Documents/ДекларацияСоответствияУсловийТруда/ДекларацияСоответствияУсловийТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДекларацияСоответствияУсловийТруда</name>
  <basedOn>Document.ПодготовкаСпецоценкиУсловийТруда</basedOn>
  <basedOn>Document.РезультатыСпецоценкиУсловийТруда</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РезультатыСпецоценкиУсловийТруда</types>
      <types>DocumentRef.ПодготовкаСпецоценкиУсловийТруда</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитыЗаключенияЭксперта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПодписиРуководителя</name>
    <type>
      <types>DefinedType.ОснованиеПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РабочиеМеста</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>DefinedType.УсловияТруда</types>
      </type>
    </attributes>
    <attributes>
      <name>Численность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/InformationRegisters/КлассыУсловийТрудаПоДолжностям/КлассыУсловийТрудаПоДолжностям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КлассыУсловийТрудаПоДолжностям</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КлассУсловийТруда</name>
    <type>
      <types>EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрацииИзменений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РезультатыСпецоценкиУсловийТруда</types>
      <types>DocumentRef.УтверждениеШтатногоРасписания</types>
      <types>DocumentRef.ИзменениеШтатногоРасписания</types>
    </type>
  </attributes>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>DefinedType.УсловияТруда</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/ZUP/zup_edt/src/Documents/РезультатыСпецоценкиУсловийТруда/РезультатыСпецоценкиУсловийТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатыСпецоценкиУсловийТруда</name>
  <basedOn>Document.ПодготовкаСпецоценкиУсловийТруда</basedOn>
  <registerRecords>InformationRegister.РезультатыСпециальнойОценкиУсловийТруда</registerRecords>
  <registerRecords>InformationRegister.ПлановыеДатыСпециальнойОценкиУсловийТруда</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПодготовкаСпецоценкиУсловийТруда</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРезультатов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПодписиРуководителя</name>
    <type>
      <types>DefinedType.ОснованиеПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОхрануТруда</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственногоЗаОхрануТруда</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПодписиОтветственногоЗаОхрануТруда</name>
    <type>
      <types>DefinedType.ОснованиеПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РабочиеМеста</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.ШтатноеРасписание</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРабочегоМеста</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлассУсловийТруда</name>
      <type>
        <types>EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</types>
      </type>
    </attributes>
    <attributes>
      <name>Рекомендации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АналогичныеМеста</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.ШтатноеРасписание</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогичноеМесто</name>
      <type>
        <types>DefinedType.УсловияТруда</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комиссия</name>
    <attributes>
      <name>ЧленКомиссии</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РольВКомиссии</name>
      <type>
        <types>EnumRef.РолиЧленовКомиссииОхраныТруда</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/Documents/ДекларацияСоответствияУсловийТруда/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		МетаданныеОбъекта = Метаданные();
		Для Каждого ПараметрЗаполнения Из ДанныеЗаполнения Цикл
			Если МетаданныеОбъекта.Реквизиты.Найти(ПараметрЗаполнения.Ключ)<>Неопределено Тогда
				ЭтотОбъект[ПараметрЗаполнения.Ключ] = ПараметрЗаполнения.Значение;
			Иначе
				Если ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеОбъекта.СтандартныеРеквизиты, ПараметрЗаполнения.Ключ) Тогда
					ЭтотОбъект[ПараметрЗаполнения.Ключ] = ПараметрЗаполнения.Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПодготовкаСпецоценкиУсловийТруда")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РезультатыСпецоценкиУсловийТруда") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		РабочиеМеста.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		Запрос.УстановитьПараметр("ДатаДокумента", Дата);
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			РеквизитыДокументаОснование = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Организация, Исполнитель", Истина);
			Организация = РеквизитыДокументаОснование.Организация;
			Исполнитель = РеквизитыДокументаОснование.Исполнитель;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Организация) Тогда
			Возврат;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолученияСотрудниковОрганизаций.Организация = Организация;
		
		КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудниковОрганизаций);
		
		ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
		Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиОрганизации");
		КадровыеДанные = "ДолжностьПоШтатномуРасписанию";
		КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
		УстановитьПривилегированныйРежим(Ложь);
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ТаблицаДокумента.Ссылка КАК Документ,
			|	ТаблицаДокументаРабочиеМеста.РабочееМесто КАК РабочееМесто
			|ПОМЕСТИТЬ ВТРабочиеМеста
			|ИЗ
			|	#ТаблицаДокументаОсновная КАК ТаблицаДокумента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ТаблицаДокументаРабочиеМеста КАК ТаблицаДокументаРабочиеМеста
			|		ПО ТаблицаДокумента.Ссылка = ТаблицаДокументаРабочиеМеста.Ссылка
			|ГДЕ
			|	ТаблицаДокумента.Ссылка = &ДокументОснование
			|	И ТаблицаДокументаРабочиеМеста.КлассУсловийТрудаПоРезультатамПредыдущейОценки В (ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Оптимальный), ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый), ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РабочиеМеста.Документ КАК Документ,
			|	ТаблицаДокументаАналогичныеМеста.АналогичноеМесто КАК РабочееМесто
			|ПОМЕСТИТЬ ВТВсеРабочиеМеста
			|ИЗ
			|	#ТаблицаДокументаАналогичныеМеста КАК ТаблицаДокументаАналогичныеМеста
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРабочиеМеста КАК РабочиеМеста
			|		ПО ТаблицаДокументаАналогичныеМеста.Ссылка = РабочиеМеста.Документ
			|			И ТаблицаДокументаАналогичныеМеста.РабочееМесто = РабочиеМеста.РабочееМесто
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РабочиеМеста.Документ,
			|	РабочиеМеста.РабочееМесто
			|ИЗ
			|	ВТРабочиеМеста КАК РабочиеМеста
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВсеРабочиеМеста.РабочееМесто КАК РабочееМесто,
			|	КОЛИЧЕСТВО(КадровыеДанныеСотрудников.Сотрудник) КАК Численность
			|ИЗ
			|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсеРабочиеМеста КАК ВсеРабочиеМеста
			|		ПО КадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию = ВсеРабочиеМеста.РабочееМесто
			|
			|СГРУППИРОВАТЬ ПО
			|	ВсеРабочиеМеста.РабочееМесто";
			
			МетаданныеДокумента = ДокументОснование.Метаданные();
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ТаблицаДокументаОсновная", МетаданныеДокумента.ПолноеИмя());
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ТаблицаДокументаРабочиеМеста", МетаданныеДокумента.ПолноеИмя() + ".РабочиеМеста");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ТаблицаДокументаАналогичныеМеста", МетаданныеДокумента.ПолноеИмя() + ".АналогичныеМеста");
			Если МетаданныеДокумента.ПолноеИмя() = "Документ.РезультатыСпецоценкиУсловийТруда" Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаДокументаРабочиеМеста.КлассУсловийТрудаПоРезультатамПредыдущейОценки", "ТаблицаДокументаРабочиеМеста.КлассУсловийТруда");
			КонецЕсли;
		Иначе
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	КадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию КАК РабочееМесто,
			|	КОЛИЧЕСТВО(КадровыеДанныеСотрудников.Сотрудник) КАК Численность
			|ИЗ
			|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлассыУсловийТрудаПоДолжностям.СрезПоследних(&ДатаДокумента, ) КАК КлассыУсловийТрудаПоДолжностямСрезПоследних
			|		ПО КадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию = КлассыУсловийТрудаПоДолжностямСрезПоследних.Должность
			|ГДЕ
			|	КлассыУсловийТрудаПоДолжностямСрезПоследних.КлассУсловийТруда В (ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Оптимальный), ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый), ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка))
			|
			|СГРУППИРОВАТЬ ПО
			|	КадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию";
			
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаРабочегоМеста = РабочиеМеста.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРабочегоМеста, Выборка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьМесяца(Ссылка, ДатаПодачи, "Объект.ДатаПодачи", Отказ, НСтр("ru='Период отчета'"), , , Ложь);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
